# Longitude Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
City..::..Longitude Property
City Class See Also
---
Longitude of the city
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Longitude { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Longitude As Double
	Get
```

Visual C++
---
```text
public:
property double Longitude {
	double get ();
}
```

# Remarks
A read only property that contains the longitude of the city. The value returned is in radians, ranging from -PI to +PI.
# See Also
City Class
Autodesk.Revit.DB Namespace